zephyrproject-rtos/hal_bouffalolab/include/bouffalolab/bl808/ef_data_reg.h
/* 0x4 : ef_dbg_pwd_low */
#define EF_DATA_EF_DBG_PWD_LOW_OFFSET                           (0x4)
#define EF_DATA_EF_DBG_PWD_LOW                                  EF_DATA_EF_DBG_PWD_LOW
#define EF_DATA_EF_DBG_PWD_LOW_POS                              (0U)
#define EF_DATA_EF_DBG_PWD_LOW_LEN                              (32U)
#define EF_DATA_EF_DBG_PWD_LOW_MSK                              (((1U<<EF_DATA_EF_DBG_PWD_LOW_LEN)-1)<<EF_DATA_EF_DBG_PWD_LOW_POS)
#define EF_DATA_EF_DBG_PWD_LOW_UMSK                             (~(((1U<<EF_DATA_EF_DBG_PWD_LOW_LEN)-1)<<EF_DATA_EF_DBG_PWD_LOW_POS))

/* 0x8 : ef_dbg_pwd_high */
#define EF_DATA_EF_DBG_PWD_HIGH_OFFSET                          (0x8)
#define EF_DATA_EF_DBG_PWD_HIGH                                 EF_DATA_EF_DBG_PWD_HIGH
#define EF_DATA_EF_DBG_PWD_HIGH_POS                             (0U)
#define EF_DATA_EF_DBG_PWD_HIGH_LEN                             (32U)
#define EF_DATA_EF_DBG_PWD_HIGH_MSK                             (((1U<<EF_DATA_EF_DBG_PWD_HIGH_LEN)-1)<<EF_DATA_EF_DBG_PWD_HIGH_POS)
#define EF_DATA_EF_DBG_PWD_HIGH_UMSK                            (~(((1U<<EF_DATA_EF_DBG_PWD_HIGH_LEN)-1)<<EF_DATA_EF_DBG_PWD_HIGH_POS))

/* 0xC : ef_dbg_pwd2_low */
#define EF_DATA_EF_DBG_PWD2_LOW_OFFSET                          (0xC)
#define EF_DATA_EF_DBG_PWD2_LOW                                 EF_DATA_EF_DBG_PWD2_LOW
#define EF_DATA_EF_DBG_PWD2_LOW_POS                             (0U)
#define EF_DATA_EF_DBG_PWD2_LOW_LEN                             (32U)
#define EF_DATA_EF_DBG_PWD2_LOW_MSK                             (((1U<<EF_DATA_EF_DBG_PWD2_LOW_LEN)-1)<<EF_DATA_EF_DBG_PWD2_LOW_POS)
#define EF_DATA_EF_DBG_PWD2_LOW_UMSK                            (~(((1U<<EF_DATA_EF_DBG_PWD2_LOW_LEN)-1)<<EF_DATA_EF_DBG_PWD2_LOW_POS))

/* 0x10 : ef_dbg_pwd2_high */
#define EF_DATA_EF_DBG_PWD2_HIGH_OFFSET                         (0x10)
#define EF_DATA_EF_DBG_PWD2_HIGH                                EF_DATA_EF_DBG_PWD2_HIGH
#define EF_DATA_EF_DBG_PWD2_HIGH_POS                            (0U)
#define EF_DATA_EF_DBG_PWD2_HIGH_LEN                            (32U)
#define EF_DATA_EF_DBG_PWD2_HIGH_MSK                            (((1U<<EF_DATA_EF_DBG_PWD2_HIGH_LEN)-1)<<EF_DATA_EF_DBG_PWD2_HIGH_POS)
#define EF_DATA_EF_DBG_PWD2_HIGH_UMSK                           (~(((1U<<EF_DATA_EF_DBG_PWD2_HIGH_LEN)-1)<<EF_DATA_EF_DBG_PWD2_HIGH_POS))

/* 0x14 : ef_wifi_mac_low */
#define EF_DATA_EF_WIFI_MAC_LOW_OFFSET                          (0x14)
#define EF_DATA_EF_WIFI_MAC_LOW                                 EF_DATA_EF_WIFI_MAC_LOW
#define EF_DATA_EF_WIFI_MAC_LOW_POS                             (0U)
#define EF_DATA_EF_WIFI_MAC_LOW_LEN                             (32U)
#define EF_DATA_EF_WIFI_MAC_LOW_MSK                             (((1U<<EF_DATA_EF_WIFI_MAC_LOW_LEN)-1)<<EF_DATA_EF_WIFI_MAC_LOW_POS)
#define EF_DATA_EF_WIFI_MAC_LOW_UMSK                            (~(((1U<<EF_DATA_EF_WIFI_MAC_LOW_LEN)-1)<<EF_DATA_EF_WIFI_MAC_LOW_POS))

/* 0x18 : ef_wifi_mac_high */
#define EF_DATA_EF_WIFI_MAC_HIGH_OFFSET                         (0x18)
#define EF_DATA_EF_WIFI_MAC_HIGH                                EF_DATA_EF_WIFI_MAC_HIGH
#define EF_DATA_EF_WIFI_MAC_HIGH_POS                            (0U)
#define EF_DATA_EF_WIFI_MAC_HIGH_LEN                            (32U)
#define EF_DATA_EF_WIFI_MAC_HIGH_MSK                            (((1U<<EF_DATA_EF_WIFI_MAC_HIGH_LEN)-1)<<EF_DATA_EF_WIFI_MAC_HIGH_POS)
#define EF_DATA_EF_WIFI_MAC_HIGH_UMSK                           (~(((1U<<EF_DATA_EF_WIFI_MAC_HIGH_LEN)-1)<<EF_DATA_EF_WIFI_MAC_HIGH_POS))

/* 0x1C : ef_key_slot_0_w0 */
#define EF_DATA_EF_KEY_SLOT_0_W0_OFFSET                         (0x1C)
#define EF_DATA_EF_KEY_SLOT_0_W0                                EF_DATA_EF_KEY_SLOT_0_W0
#define EF_DATA_EF_KEY_SLOT_0_W0_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_0_W0_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_0_W0_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_0_W0_LEN)-1)<<EF_DATA_EF_KEY_SLOT_0_W0_POS)
#define EF_DATA_EF_KEY_SLOT_0_W0_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_0_W0_LEN)-1)<<EF_DATA_EF_KEY_SLOT_0_W0_POS))

/* 0x20 : ef_key_slot_0_w1 */
#define EF_DATA_EF_KEY_SLOT_0_W1_OFFSET                         (0x20)
#define EF_DATA_EF_KEY_SLOT_0_W1                                EF_DATA_EF_KEY_SLOT_0_W1
#define EF_DATA_EF_KEY_SLOT_0_W1_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_0_W1_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_0_W1_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_0_W1_LEN)-1)<<EF_DATA_EF_KEY_SLOT_0_W1_POS)
#define EF_DATA_EF_KEY_SLOT_0_W1_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_0_W1_LEN)-1)<<EF_DATA_EF_KEY_SLOT_0_W1_POS))

/* 0x24 : ef_key_slot_0_w2 */
#define EF_DATA_EF_KEY_SLOT_0_W2_OFFSET                         (0x24)
#define EF_DATA_EF_KEY_SLOT_0_W2                                EF_DATA_EF_KEY_SLOT_0_W2
#define EF_DATA_EF_KEY_SLOT_0_W2_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_0_W2_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_0_W2_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_0_W2_LEN)-1)<<EF_DATA_EF_KEY_SLOT_0_W2_POS)
#define EF_DATA_EF_KEY_SLOT_0_W2_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_0_W2_LEN)-1)<<EF_DATA_EF_KEY_SLOT_0_W2_POS))

/* 0x28 : ef_key_slot_0_w3 */
#define EF_DATA_EF_KEY_SLOT_0_W3_OFFSET                         (0x28)
#define EF_DATA_EF_KEY_SLOT_0_W3                                EF_DATA_EF_KEY_SLOT_0_W3
#define EF_DATA_EF_KEY_SLOT_0_W3_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_0_W3_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_0_W3_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_0_W3_LEN)-1)<<EF_DATA_EF_KEY_SLOT_0_W3_POS)
#define EF_DATA_EF_KEY_SLOT_0_W3_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_0_W3_LEN)-1)<<EF_DATA_EF_KEY_SLOT_0_W3_POS))

/* 0x2C : ef_key_slot_1_w0 */
#define EF_DATA_EF_KEY_SLOT_1_W0_OFFSET                         (0x2C)
#define EF_DATA_EF_KEY_SLOT_1_W0                                EF_DATA_EF_KEY_SLOT_1_W0
#define EF_DATA_EF_KEY_SLOT_1_W0_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_1_W0_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_1_W0_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_1_W0_LEN)-1)<<EF_DATA_EF_KEY_SLOT_1_W0_POS)
#define EF_DATA_EF_KEY_SLOT_1_W0_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_1_W0_LEN)-1)<<EF_DATA_EF_KEY_SLOT_1_W0_POS))

