zephyrproject-rtos/hal_bouffalolab/include/bouffalolab/bl808/ef_data_reg.h
/* 0x30 : ef_key_slot_1_w1 */
#define EF_DATA_EF_KEY_SLOT_1_W1_OFFSET                         (0x30)
#define EF_DATA_EF_KEY_SLOT_1_W1                                EF_DATA_EF_KEY_SLOT_1_W1
#define EF_DATA_EF_KEY_SLOT_1_W1_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_1_W1_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_1_W1_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_1_W1_LEN)-1)<<EF_DATA_EF_KEY_SLOT_1_W1_POS)
#define EF_DATA_EF_KEY_SLOT_1_W1_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_1_W1_LEN)-1)<<EF_DATA_EF_KEY_SLOT_1_W1_POS))

/* 0x34 : ef_key_slot_1_w2 */
#define EF_DATA_EF_KEY_SLOT_1_W2_OFFSET                         (0x34)
#define EF_DATA_EF_KEY_SLOT_1_W2                                EF_DATA_EF_KEY_SLOT_1_W2
#define EF_DATA_EF_KEY_SLOT_1_W2_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_1_W2_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_1_W2_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_1_W2_LEN)-1)<<EF_DATA_EF_KEY_SLOT_1_W2_POS)
#define EF_DATA_EF_KEY_SLOT_1_W2_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_1_W2_LEN)-1)<<EF_DATA_EF_KEY_SLOT_1_W2_POS))

/* 0x38 : ef_key_slot_1_w3 */
#define EF_DATA_EF_KEY_SLOT_1_W3_OFFSET                         (0x38)
#define EF_DATA_EF_KEY_SLOT_1_W3                                EF_DATA_EF_KEY_SLOT_1_W3
#define EF_DATA_EF_KEY_SLOT_1_W3_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_1_W3_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_1_W3_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_1_W3_LEN)-1)<<EF_DATA_EF_KEY_SLOT_1_W3_POS)
#define EF_DATA_EF_KEY_SLOT_1_W3_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_1_W3_LEN)-1)<<EF_DATA_EF_KEY_SLOT_1_W3_POS))

/* 0x3C : ef_key_slot_2_w0 */
#define EF_DATA_EF_KEY_SLOT_2_W0_OFFSET                         (0x3C)
#define EF_DATA_EF_KEY_SLOT_2_W0                                EF_DATA_EF_KEY_SLOT_2_W0
#define EF_DATA_EF_KEY_SLOT_2_W0_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_2_W0_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_2_W0_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_2_W0_LEN)-1)<<EF_DATA_EF_KEY_SLOT_2_W0_POS)
#define EF_DATA_EF_KEY_SLOT_2_W0_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_2_W0_LEN)-1)<<EF_DATA_EF_KEY_SLOT_2_W0_POS))

/* 0x40 : ef_key_slot_2_w1 */
#define EF_DATA_EF_KEY_SLOT_2_W1_OFFSET                         (0x40)
#define EF_DATA_EF_KEY_SLOT_2_W1                                EF_DATA_EF_KEY_SLOT_2_W1
#define EF_DATA_EF_KEY_SLOT_2_W1_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_2_W1_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_2_W1_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_2_W1_LEN)-1)<<EF_DATA_EF_KEY_SLOT_2_W1_POS)
#define EF_DATA_EF_KEY_SLOT_2_W1_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_2_W1_LEN)-1)<<EF_DATA_EF_KEY_SLOT_2_W1_POS))

/* 0x44 : ef_key_slot_2_w2 */
#define EF_DATA_EF_KEY_SLOT_2_W2_OFFSET                         (0x44)
#define EF_DATA_EF_KEY_SLOT_2_W2                                EF_DATA_EF_KEY_SLOT_2_W2
#define EF_DATA_EF_KEY_SLOT_2_W2_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_2_W2_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_2_W2_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_2_W2_LEN)-1)<<EF_DATA_EF_KEY_SLOT_2_W2_POS)
#define EF_DATA_EF_KEY_SLOT_2_W2_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_2_W2_LEN)-1)<<EF_DATA_EF_KEY_SLOT_2_W2_POS))

/* 0x48 : ef_key_slot_2_w3 */
#define EF_DATA_EF_KEY_SLOT_2_W3_OFFSET                         (0x48)
#define EF_DATA_EF_KEY_SLOT_2_W3                                EF_DATA_EF_KEY_SLOT_2_W3
#define EF_DATA_EF_KEY_SLOT_2_W3_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_2_W3_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_2_W3_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_2_W3_LEN)-1)<<EF_DATA_EF_KEY_SLOT_2_W3_POS)
#define EF_DATA_EF_KEY_SLOT_2_W3_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_2_W3_LEN)-1)<<EF_DATA_EF_KEY_SLOT_2_W3_POS))

/* 0x4C : ef_key_slot_3_w0 */
#define EF_DATA_EF_KEY_SLOT_3_W0_OFFSET                         (0x4C)
#define EF_DATA_EF_KEY_SLOT_3_W0                                EF_DATA_EF_KEY_SLOT_3_W0
#define EF_DATA_EF_KEY_SLOT_3_W0_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_3_W0_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_3_W0_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_3_W0_LEN)-1)<<EF_DATA_EF_KEY_SLOT_3_W0_POS)
#define EF_DATA_EF_KEY_SLOT_3_W0_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_3_W0_LEN)-1)<<EF_DATA_EF_KEY_SLOT_3_W0_POS))

/* 0x50 : ef_key_slot_3_w1 */
#define EF_DATA_EF_KEY_SLOT_3_W1_OFFSET                         (0x50)
#define EF_DATA_EF_KEY_SLOT_3_W1                                EF_DATA_EF_KEY_SLOT_3_W1
#define EF_DATA_EF_KEY_SLOT_3_W1_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_3_W1_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_3_W1_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_3_W1_LEN)-1)<<EF_DATA_EF_KEY_SLOT_3_W1_POS)
#define EF_DATA_EF_KEY_SLOT_3_W1_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_3_W1_LEN)-1)<<EF_DATA_EF_KEY_SLOT_3_W1_POS))

/* 0x54 : ef_key_slot_3_w2 */
#define EF_DATA_EF_KEY_SLOT_3_W2_OFFSET                         (0x54)
#define EF_DATA_EF_KEY_SLOT_3_W2                                EF_DATA_EF_KEY_SLOT_3_W2
#define EF_DATA_EF_KEY_SLOT_3_W2_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_3_W2_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_3_W2_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_3_W2_LEN)-1)<<EF_DATA_EF_KEY_SLOT_3_W2_POS)
#define EF_DATA_EF_KEY_SLOT_3_W2_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_3_W2_LEN)-1)<<EF_DATA_EF_KEY_SLOT_3_W2_POS))

