zephyrproject-rtos/hal_bouffalolab/include/bouffalolab/bl808/ef_data_reg.h
/* 0x58 : ef_key_slot_3_w3 */
#define EF_DATA_EF_KEY_SLOT_3_W3_OFFSET                         (0x58)
#define EF_DATA_EF_KEY_SLOT_3_W3                                EF_DATA_EF_KEY_SLOT_3_W3
#define EF_DATA_EF_KEY_SLOT_3_W3_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_3_W3_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_3_W3_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_3_W3_LEN)-1)<<EF_DATA_EF_KEY_SLOT_3_W3_POS)
#define EF_DATA_EF_KEY_SLOT_3_W3_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_3_W3_LEN)-1)<<EF_DATA_EF_KEY_SLOT_3_W3_POS))

/* 0x5C : ef_sw_usage_0 */
#define EF_DATA_EF_SW_USAGE_0_OFFSET                            (0x5C)
#define EF_DATA_EF_SW_USAGE_0                                   EF_DATA_EF_SW_USAGE_0
#define EF_DATA_EF_SW_USAGE_0_POS                               (0U)
#define EF_DATA_EF_SW_USAGE_0_LEN                               (32U)
#define EF_DATA_EF_SW_USAGE_0_MSK                               (((1U<<EF_DATA_EF_SW_USAGE_0_LEN)-1)<<EF_DATA_EF_SW_USAGE_0_POS)
#define EF_DATA_EF_SW_USAGE_0_UMSK                              (~(((1U<<EF_DATA_EF_SW_USAGE_0_LEN)-1)<<EF_DATA_EF_SW_USAGE_0_POS))

#define EF_DATA_EF_SBOOT_SIGN_MODE                              EF_DATA_EF_SBOOT_SIGN_MODE
#define EF_DATA_EF_SBOOT_SIGN_MODE_POS                          (7U)
#define EF_DATA_EF_SBOOT_SIGN_MODE_LEN                          (1U)
#define EF_DATA_EF_SBOOT_SIGN_MODE_MSK                          (((1U << EF_DATA_EF_SBOOT_SIGN_MODE_LEN) - 1) << EF_DATA_EF_SBOOT_SIGN_MODE_POS)
#define EF_DATA_EF_SBOOT_SIGN_MODE_UMSK                         (~(((1U << EF_DATA_EF_SBOOT_SIGN_MODE_LEN) - 1) << EF_DATA_EF_SBOOT_SIGN_MODE_POS))

/* 0x60 : ef_sw_usage_1 */
#define EF_DATA_EF_SW_USAGE_1_OFFSET                            (0x60)
#define EF_DATA_EF_SW_USAGE_1                                   EF_DATA_EF_SW_USAGE_1
#define EF_DATA_EF_SW_USAGE_1_POS                               (0U)
#define EF_DATA_EF_SW_USAGE_1_LEN                               (32U)
#define EF_DATA_EF_SW_USAGE_1_MSK                               (((1U<<EF_DATA_EF_SW_USAGE_1_LEN)-1)<<EF_DATA_EF_SW_USAGE_1_POS)
#define EF_DATA_EF_SW_USAGE_1_UMSK                              (~(((1U<<EF_DATA_EF_SW_USAGE_1_LEN)-1)<<EF_DATA_EF_SW_USAGE_1_POS))

/* 0x64 : ef_sw_usage_2 */
#define EF_DATA_EF_SW_USAGE_2_OFFSET                            (0x64)
#define EF_DATA_EF_SW_USAGE_2                                   EF_DATA_EF_SW_USAGE_2
#define EF_DATA_EF_SW_USAGE_2_POS                               (0U)
#define EF_DATA_EF_SW_USAGE_2_LEN                               (32U)
#define EF_DATA_EF_SW_USAGE_2_MSK                               (((1U<<EF_DATA_EF_SW_USAGE_2_LEN)-1)<<EF_DATA_EF_SW_USAGE_2_POS)
#define EF_DATA_EF_SW_USAGE_2_UMSK                              (~(((1U<<EF_DATA_EF_SW_USAGE_2_LEN)-1)<<EF_DATA_EF_SW_USAGE_2_POS))

/* 0x68 : ef_sw_usage_3 */
#define EF_DATA_EF_SW_USAGE_3_OFFSET                            (0x68)
#define EF_DATA_EF_SW_USAGE_3                                   EF_DATA_EF_SW_USAGE_3
#define EF_DATA_EF_SW_USAGE_3_POS                               (0U)
#define EF_DATA_EF_SW_USAGE_3_LEN                               (32U)
#define EF_DATA_EF_SW_USAGE_3_MSK                               (((1U<<EF_DATA_EF_SW_USAGE_3_LEN)-1)<<EF_DATA_EF_SW_USAGE_3_POS)
#define EF_DATA_EF_SW_USAGE_3_UMSK                              (~(((1U<<EF_DATA_EF_SW_USAGE_3_LEN)-1)<<EF_DATA_EF_SW_USAGE_3_POS))

/* 0x6C : ef_key_slot_11_w0 */
#define EF_DATA_EF_KEY_SLOT_11_W0_OFFSET                        (0x6C)
#define EF_DATA_EF_KEY_SLOT_11_W0                               EF_DATA_EF_KEY_SLOT_11_W0
#define EF_DATA_EF_KEY_SLOT_11_W0_POS                           (0U)
#define EF_DATA_EF_KEY_SLOT_11_W0_LEN                           (32U)
#define EF_DATA_EF_KEY_SLOT_11_W0_MSK                           (((1U<<EF_DATA_EF_KEY_SLOT_11_W0_LEN)-1)<<EF_DATA_EF_KEY_SLOT_11_W0_POS)
#define EF_DATA_EF_KEY_SLOT_11_W0_UMSK                          (~(((1U<<EF_DATA_EF_KEY_SLOT_11_W0_LEN)-1)<<EF_DATA_EF_KEY_SLOT_11_W0_POS))

/* 0x70 : ef_key_slot_11_w1 */
#define EF_DATA_EF_KEY_SLOT_11_W1_OFFSET                        (0x70)
#define EF_DATA_EF_KEY_SLOT_11_W1                               EF_DATA_EF_KEY_SLOT_11_W1
#define EF_DATA_EF_KEY_SLOT_11_W1_POS                           (0U)
#define EF_DATA_EF_KEY_SLOT_11_W1_LEN                           (32U)
#define EF_DATA_EF_KEY_SLOT_11_W1_MSK                           (((1U<<EF_DATA_EF_KEY_SLOT_11_W1_LEN)-1)<<EF_DATA_EF_KEY_SLOT_11_W1_POS)
#define EF_DATA_EF_KEY_SLOT_11_W1_UMSK                          (~(((1U<<EF_DATA_EF_KEY_SLOT_11_W1_LEN)-1)<<EF_DATA_EF_KEY_SLOT_11_W1_POS))

/* 0x74 : ef_key_slot_11_w2 */
#define EF_DATA_EF_KEY_SLOT_11_W2_OFFSET                        (0x74)
#define EF_DATA_EF_KEY_SLOT_11_W2                               EF_DATA_EF_KEY_SLOT_11_W2
#define EF_DATA_EF_KEY_SLOT_11_W2_POS                           (0U)
#define EF_DATA_EF_KEY_SLOT_11_W2_LEN                           (32U)
#define EF_DATA_EF_KEY_SLOT_11_W2_MSK                           (((1U<<EF_DATA_EF_KEY_SLOT_11_W2_LEN)-1)<<EF_DATA_EF_KEY_SLOT_11_W2_POS)
#define EF_DATA_EF_KEY_SLOT_11_W2_UMSK                          (~(((1U<<EF_DATA_EF_KEY_SLOT_11_W2_LEN)-1)<<EF_DATA_EF_KEY_SLOT_11_W2_POS))

/* 0x78 : ef_key_slot_11_w3 */
#define EF_DATA_EF_KEY_SLOT_11_W3_OFFSET                        (0x78)
#define EF_DATA_EF_KEY_SLOT_11_W3                               EF_DATA_EF_KEY_SLOT_11_W3
#define EF_DATA_EF_KEY_SLOT_11_W3_POS                           (0U)
#define EF_DATA_EF_KEY_SLOT_11_W3_LEN                           (32U)
#define EF_DATA_EF_KEY_SLOT_11_W3_MSK                           (((1U<<EF_DATA_EF_KEY_SLOT_11_W3_LEN)-1)<<EF_DATA_EF_KEY_SLOT_11_W3_POS)
#define EF_DATA_EF_KEY_SLOT_11_W3_UMSK                          (~(((1U<<EF_DATA_EF_KEY_SLOT_11_W3_LEN)-1)<<EF_DATA_EF_KEY_SLOT_11_W3_POS))

/* 0x7C : ef_data_0_lock */
#define EF_DATA_0_LOCK_OFFSET                                   (0x7C)
#define EF_DATA_EF_SEC_LIFECYCLE                                EF_DATA_EF_SEC_LIFECYCLE
#define EF_DATA_EF_SEC_LIFECYCLE_POS                            (0U)
#define EF_DATA_EF_SEC_LIFECYCLE_LEN                            (4U)
#define EF_DATA_EF_SEC_LIFECYCLE_MSK                            (((1U<<EF_DATA_EF_SEC_LIFECYCLE_LEN)-1)<<EF_DATA_EF_SEC_LIFECYCLE_POS)
#define EF_DATA_EF_SEC_LIFECYCLE_UMSK                           (~(((1U<<EF_DATA_EF_SEC_LIFECYCLE_LEN)-1)<<EF_DATA_EF_SEC_LIFECYCLE_POS))
#define EF_DATA_WR_LOCK_RSVD_0                                  EF_DATA_WR_LOCK_RSVD_0
#define EF_DATA_WR_LOCK_RSVD_0_POS                              (4U)
#define EF_DATA_WR_LOCK_RSVD_0_LEN                              (9U)
#define EF_DATA_WR_LOCK_RSVD_0_MSK                              (((1U<<EF_DATA_WR_LOCK_RSVD_0_LEN)-1)<<EF_DATA_WR_LOCK_RSVD_0_POS)
#define EF_DATA_WR_LOCK_RSVD_0_UMSK                             (~(((1U<<EF_DATA_WR_LOCK_RSVD_0_LEN)-1)<<EF_DATA_WR_LOCK_RSVD_0_POS))
#define EF_DATA_FLASH_DLY_COE                                   EF_DATA_FLASH_DLY_COE
#define EF_DATA_FLASH_DLY_COE_POS                               (13U)
#define EF_DATA_FLASH_DLY_COE_LEN                               (1U)
#define EF_DATA_FLASH_DLY_COE_MSK                               (((1U<<EF_DATA_FLASH_DLY_COE_LEN)-1)<<EF_DATA_FLASH_DLY_COE_POS)
#define EF_DATA_FLASH_DLY_COE_UMSK                              (~(((1U<<EF_DATA_FLASH_DLY_COE_LEN)-1)<<EF_DATA_FLASH_DLY_COE_POS))
#define EF_DATA_WR_LOCK_BOOT_MODE                               EF_DATA_WR_LOCK_BOOT_MODE
#define EF_DATA_WR_LOCK_BOOT_MODE_POS                           (14U)
#define EF_DATA_WR_LOCK_BOOT_MODE_LEN                           (1U)
#define EF_DATA_WR_LOCK_BOOT_MODE_MSK                           (((1U<<EF_DATA_WR_LOCK_BOOT_MODE_LEN)-1)<<EF_DATA_WR_LOCK_BOOT_MODE_POS)
#define EF_DATA_WR_LOCK_BOOT_MODE_UMSK                          (~(((1U<<EF_DATA_WR_LOCK_BOOT_MODE_LEN)-1)<<EF_DATA_WR_LOCK_BOOT_MODE_POS))
#define EF_DATA_WR_LOCK_DBG_PWD                                 EF_DATA_WR_LOCK_DBG_PWD
#define EF_DATA_WR_LOCK_DBG_PWD_POS                             (15U)
#define EF_DATA_WR_LOCK_DBG_PWD_LEN                             (1U)
#define EF_DATA_WR_LOCK_DBG_PWD_MSK                             (((1U<<EF_DATA_WR_LOCK_DBG_PWD_LEN)-1)<<EF_DATA_WR_LOCK_DBG_PWD_POS)
#define EF_DATA_WR_LOCK_DBG_PWD_UMSK                            (~(((1U<<EF_DATA_WR_LOCK_DBG_PWD_LEN)-1)<<EF_DATA_WR_LOCK_DBG_PWD_POS))
#define EF_DATA_WR_LOCK_WIFI_MAC                                EF_DATA_WR_LOCK_WIFI_MAC
#define EF_DATA_WR_LOCK_WIFI_MAC_POS                            (16U)
#define EF_DATA_WR_LOCK_WIFI_MAC_LEN                            (1U)
#define EF_DATA_WR_LOCK_WIFI_MAC_MSK                            (((1U<<EF_DATA_WR_LOCK_WIFI_MAC_LEN)-1)<<EF_DATA_WR_LOCK_WIFI_MAC_POS)
#define EF_DATA_WR_LOCK_WIFI_MAC_UMSK                           (~(((1U<<EF_DATA_WR_LOCK_WIFI_MAC_LEN)-1)<<EF_DATA_WR_LOCK_WIFI_MAC_POS))
#define EF_DATA_WR_LOCK_KEY_SLOT_0                              EF_DATA_WR_LOCK_KEY_SLOT_0
#define EF_DATA_WR_LOCK_KEY_SLOT_0_POS                          (17U)
#define EF_DATA_WR_LOCK_KEY_SLOT_0_LEN                          (1U)
#define EF_DATA_WR_LOCK_KEY_SLOT_0_MSK                          (((1U<<EF_DATA_WR_LOCK_KEY_SLOT_0_LEN)-1)<<EF_DATA_WR_LOCK_KEY_SLOT_0_POS)
#define EF_DATA_WR_LOCK_KEY_SLOT_0_UMSK                         (~(((1U<<EF_DATA_WR_LOCK_KEY_SLOT_0_LEN)-1)<<EF_DATA_WR_LOCK_KEY_SLOT_0_POS))
#define EF_DATA_WR_LOCK_KEY_SLOT_1                              EF_DATA_WR_LOCK_KEY_SLOT_1
#define EF_DATA_WR_LOCK_KEY_SLOT_1_POS                          (18U)
#define EF_DATA_WR_LOCK_KEY_SLOT_1_LEN                          (1U)
#define EF_DATA_WR_LOCK_KEY_SLOT_1_MSK                          (((1U<<EF_DATA_WR_LOCK_KEY_SLOT_1_LEN)-1)<<EF_DATA_WR_LOCK_KEY_SLOT_1_POS)
#define EF_DATA_WR_LOCK_KEY_SLOT_1_UMSK                         (~(((1U<<EF_DATA_WR_LOCK_KEY_SLOT_1_LEN)-1)<<EF_DATA_WR_LOCK_KEY_SLOT_1_POS))
#define EF_DATA_WR_LOCK_KEY_SLOT_2                              EF_DATA_WR_LOCK_KEY_SLOT_2
#define EF_DATA_WR_LOCK_KEY_SLOT_2_POS                          (19U)
#define EF_DATA_WR_LOCK_KEY_SLOT_2_LEN                          (1U)
#define EF_DATA_WR_LOCK_KEY_SLOT_2_MSK                          (((1U<<EF_DATA_WR_LOCK_KEY_SLOT_2_LEN)-1)<<EF_DATA_WR_LOCK_KEY_SLOT_2_POS)
#define EF_DATA_WR_LOCK_KEY_SLOT_2_UMSK                         (~(((1U<<EF_DATA_WR_LOCK_KEY_SLOT_2_LEN)-1)<<EF_DATA_WR_LOCK_KEY_SLOT_2_POS))
#define EF_DATA_WR_LOCK_KEY_SLOT_3                              EF_DATA_WR_LOCK_KEY_SLOT_3
#define EF_DATA_WR_LOCK_KEY_SLOT_3_POS                          (20U)
#define EF_DATA_WR_LOCK_KEY_SLOT_3_LEN                          (1U)
#define EF_DATA_WR_LOCK_KEY_SLOT_3_MSK                          (((1U<<EF_DATA_WR_LOCK_KEY_SLOT_3_LEN)-1)<<EF_DATA_WR_LOCK_KEY_SLOT_3_POS)
#define EF_DATA_WR_LOCK_KEY_SLOT_3_UMSK                         (~(((1U<<EF_DATA_WR_LOCK_KEY_SLOT_3_LEN)-1)<<EF_DATA_WR_LOCK_KEY_SLOT_3_POS))
#define EF_DATA_WR_LOCK_SW_USAGE_0                              EF_DATA_WR_LOCK_SW_USAGE_0
#define EF_DATA_WR_LOCK_SW_USAGE_0_POS                          (21U)
#define EF_DATA_WR_LOCK_SW_USAGE_0_LEN                          (1U)
#define EF_DATA_WR_LOCK_SW_USAGE_0_MSK                          (((1U<<EF_DATA_WR_LOCK_SW_USAGE_0_LEN)-1)<<EF_DATA_WR_LOCK_SW_USAGE_0_POS)
#define EF_DATA_WR_LOCK_SW_USAGE_0_UMSK                         (~(((1U<<EF_DATA_WR_LOCK_SW_USAGE_0_LEN)-1)<<EF_DATA_WR_LOCK_SW_USAGE_0_POS))
#define EF_DATA_WR_LOCK_SW_USAGE_1                              EF_DATA_WR_LOCK_SW_USAGE_1
#define EF_DATA_WR_LOCK_SW_USAGE_1_POS                          (22U)
#define EF_DATA_WR_LOCK_SW_USAGE_1_LEN                          (1U)
#define EF_DATA_WR_LOCK_SW_USAGE_1_MSK                          (((1U<<EF_DATA_WR_LOCK_SW_USAGE_1_LEN)-1)<<EF_DATA_WR_LOCK_SW_USAGE_1_POS)
#define EF_DATA_WR_LOCK_SW_USAGE_1_UMSK                         (~(((1U<<EF_DATA_WR_LOCK_SW_USAGE_1_LEN)-1)<<EF_DATA_WR_LOCK_SW_USAGE_1_POS))
#define EF_DATA_WR_LOCK_SW_USAGE_2                              EF_DATA_WR_LOCK_SW_USAGE_2
#define EF_DATA_WR_LOCK_SW_USAGE_2_POS                          (23U)
#define EF_DATA_WR_LOCK_SW_USAGE_2_LEN                          (1U)
#define EF_DATA_WR_LOCK_SW_USAGE_2_MSK                          (((1U<<EF_DATA_WR_LOCK_SW_USAGE_2_LEN)-1)<<EF_DATA_WR_LOCK_SW_USAGE_2_POS)
#define EF_DATA_WR_LOCK_SW_USAGE_2_UMSK                         (~(((1U<<EF_DATA_WR_LOCK_SW_USAGE_2_LEN)-1)<<EF_DATA_WR_LOCK_SW_USAGE_2_POS))
#define EF_DATA_WR_LOCK_SW_USAGE_3                              EF_DATA_WR_LOCK_SW_USAGE_3
#define EF_DATA_WR_LOCK_SW_USAGE_3_POS                          (24U)
#define EF_DATA_WR_LOCK_SW_USAGE_3_LEN                          (1U)
#define EF_DATA_WR_LOCK_SW_USAGE_3_MSK                          (((1U<<EF_DATA_WR_LOCK_SW_USAGE_3_LEN)-1)<<EF_DATA_WR_LOCK_SW_USAGE_3_POS)
#define EF_DATA_WR_LOCK_SW_USAGE_3_UMSK                         (~(((1U<<EF_DATA_WR_LOCK_SW_USAGE_3_LEN)-1)<<EF_DATA_WR_LOCK_SW_USAGE_3_POS))
#define EF_DATA_WR_LOCK_KEY_SLOT_11                             EF_DATA_WR_LOCK_KEY_SLOT_11
#define EF_DATA_WR_LOCK_KEY_SLOT_11_POS                         (25U)
#define EF_DATA_WR_LOCK_KEY_SLOT_11_LEN                         (1U)
#define EF_DATA_WR_LOCK_KEY_SLOT_11_MSK                         (((1U<<EF_DATA_WR_LOCK_KEY_SLOT_11_LEN)-1)<<EF_DATA_WR_LOCK_KEY_SLOT_11_POS)
#define EF_DATA_WR_LOCK_KEY_SLOT_11_UMSK                        (~(((1U<<EF_DATA_WR_LOCK_KEY_SLOT_11_LEN)-1)<<EF_DATA_WR_LOCK_KEY_SLOT_11_POS))
#define EF_DATA_RD_LOCK_DBG_PWD                                 EF_DATA_RD_LOCK_DBG_PWD
#define EF_DATA_RD_LOCK_DBG_PWD_POS                             (26U)
#define EF_DATA_RD_LOCK_DBG_PWD_LEN                             (1U)
#define EF_DATA_RD_LOCK_DBG_PWD_MSK                             (((1U<<EF_DATA_RD_LOCK_DBG_PWD_LEN)-1)<<EF_DATA_RD_LOCK_DBG_PWD_POS)
#define EF_DATA_RD_LOCK_DBG_PWD_UMSK                            (~(((1U<<EF_DATA_RD_LOCK_DBG_PWD_LEN)-1)<<EF_DATA_RD_LOCK_DBG_PWD_POS))
#define EF_DATA_RD_LOCK_KEY_SLOT_0                              EF_DATA_RD_LOCK_KEY_SLOT_0
#define EF_DATA_RD_LOCK_KEY_SLOT_0_POS                          (27U)
#define EF_DATA_RD_LOCK_KEY_SLOT_0_LEN                          (1U)
#define EF_DATA_RD_LOCK_KEY_SLOT_0_MSK                          (((1U<<EF_DATA_RD_LOCK_KEY_SLOT_0_LEN)-1)<<EF_DATA_RD_LOCK_KEY_SLOT_0_POS)
#define EF_DATA_RD_LOCK_KEY_SLOT_0_UMSK                         (~(((1U<<EF_DATA_RD_LOCK_KEY_SLOT_0_LEN)-1)<<EF_DATA_RD_LOCK_KEY_SLOT_0_POS))
#define EF_DATA_RD_LOCK_KEY_SLOT_1                              EF_DATA_RD_LOCK_KEY_SLOT_1
#define EF_DATA_RD_LOCK_KEY_SLOT_1_POS                          (28U)
#define EF_DATA_RD_LOCK_KEY_SLOT_1_LEN                          (1U)
#define EF_DATA_RD_LOCK_KEY_SLOT_1_MSK                          (((1U<<EF_DATA_RD_LOCK_KEY_SLOT_1_LEN)-1)<<EF_DATA_RD_LOCK_KEY_SLOT_1_POS)
#define EF_DATA_RD_LOCK_KEY_SLOT_1_UMSK                         (~(((1U<<EF_DATA_RD_LOCK_KEY_SLOT_1_LEN)-1)<<EF_DATA_RD_LOCK_KEY_SLOT_1_POS))
#define EF_DATA_RD_LOCK_KEY_SLOT_2                              EF_DATA_RD_LOCK_KEY_SLOT_2
#define EF_DATA_RD_LOCK_KEY_SLOT_2_POS                          (29U)
#define EF_DATA_RD_LOCK_KEY_SLOT_2_LEN                          (1U)
#define EF_DATA_RD_LOCK_KEY_SLOT_2_MSK                          (((1U<<EF_DATA_RD_LOCK_KEY_SLOT_2_LEN)-1)<<EF_DATA_RD_LOCK_KEY_SLOT_2_POS)
#define EF_DATA_RD_LOCK_KEY_SLOT_2_UMSK                         (~(((1U<<EF_DATA_RD_LOCK_KEY_SLOT_2_LEN)-1)<<EF_DATA_RD_LOCK_KEY_SLOT_2_POS))
#define EF_DATA_RD_LOCK_KEY_SLOT_3                              EF_DATA_RD_LOCK_KEY_SLOT_3
#define EF_DATA_RD_LOCK_KEY_SLOT_3_POS                          (30U)
#define EF_DATA_RD_LOCK_KEY_SLOT_3_LEN                          (1U)
#define EF_DATA_RD_LOCK_KEY_SLOT_3_MSK                          (((1U<<EF_DATA_RD_LOCK_KEY_SLOT_3_LEN)-1)<<EF_DATA_RD_LOCK_KEY_SLOT_3_POS)
#define EF_DATA_RD_LOCK_KEY_SLOT_3_UMSK                         (~(((1U<<EF_DATA_RD_LOCK_KEY_SLOT_3_LEN)-1)<<EF_DATA_RD_LOCK_KEY_SLOT_3_POS))
#define EF_DATA_RD_LOCK_KEY_SLOT_11                             EF_DATA_RD_LOCK_KEY_SLOT_11
#define EF_DATA_RD_LOCK_KEY_SLOT_11_POS                         (31U)
#define EF_DATA_RD_LOCK_KEY_SLOT_11_LEN                         (1U)
#define EF_DATA_RD_LOCK_KEY_SLOT_11_MSK                         (((1U<<EF_DATA_RD_LOCK_KEY_SLOT_11_LEN)-1)<<EF_DATA_RD_LOCK_KEY_SLOT_11_POS)
#define EF_DATA_RD_LOCK_KEY_SLOT_11_UMSK                        (~(((1U<<EF_DATA_RD_LOCK_KEY_SLOT_11_LEN)-1)<<EF_DATA_RD_LOCK_KEY_SLOT_11_POS))

