zephyrproject-rtos/hal_bouffalolab/include/bouffalolab/bl808/ef_data_reg.h
/* 0x80 : ef_key_slot_4_w0 */
#define EF_DATA_EF_KEY_SLOT_4_W0_OFFSET                         (0x80)
#define EF_DATA_EF_KEY_SLOT_4_W0                                EF_DATA_EF_KEY_SLOT_4_W0
#define EF_DATA_EF_KEY_SLOT_4_W0_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_4_W0_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_4_W0_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_4_W0_LEN)-1)<<EF_DATA_EF_KEY_SLOT_4_W0_POS)
#define EF_DATA_EF_KEY_SLOT_4_W0_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_4_W0_LEN)-1)<<EF_DATA_EF_KEY_SLOT_4_W0_POS))

/* 0x84 : ef_key_slot_4_w1 */
#define EF_DATA_EF_KEY_SLOT_4_W1_OFFSET                         (0x84)
#define EF_DATA_EF_KEY_SLOT_4_W1                                EF_DATA_EF_KEY_SLOT_4_W1
#define EF_DATA_EF_KEY_SLOT_4_W1_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_4_W1_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_4_W1_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_4_W1_LEN)-1)<<EF_DATA_EF_KEY_SLOT_4_W1_POS)
#define EF_DATA_EF_KEY_SLOT_4_W1_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_4_W1_LEN)-1)<<EF_DATA_EF_KEY_SLOT_4_W1_POS))

/* 0x88 : ef_key_slot_4_w2 */
#define EF_DATA_EF_KEY_SLOT_4_W2_OFFSET                         (0x88)
#define EF_DATA_EF_KEY_SLOT_4_W2                                EF_DATA_EF_KEY_SLOT_4_W2
#define EF_DATA_EF_KEY_SLOT_4_W2_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_4_W2_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_4_W2_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_4_W2_LEN)-1)<<EF_DATA_EF_KEY_SLOT_4_W2_POS)
#define EF_DATA_EF_KEY_SLOT_4_W2_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_4_W2_LEN)-1)<<EF_DATA_EF_KEY_SLOT_4_W2_POS))

/* 0x8C : ef_key_slot_4_w3 */
#define EF_DATA_EF_KEY_SLOT_4_W3_OFFSET                         (0x8C)
#define EF_DATA_EF_KEY_SLOT_4_W3                                EF_DATA_EF_KEY_SLOT_4_W3
#define EF_DATA_EF_KEY_SLOT_4_W3_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_4_W3_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_4_W3_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_4_W3_LEN)-1)<<EF_DATA_EF_KEY_SLOT_4_W3_POS)
#define EF_DATA_EF_KEY_SLOT_4_W3_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_4_W3_LEN)-1)<<EF_DATA_EF_KEY_SLOT_4_W3_POS))

/* 0x90 : ef_key_slot_5_w0 */
#define EF_DATA_EF_KEY_SLOT_5_W0_OFFSET                         (0x90)
#define EF_DATA_EF_KEY_SLOT_5_W0                                EF_DATA_EF_KEY_SLOT_5_W0
#define EF_DATA_EF_KEY_SLOT_5_W0_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_5_W0_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_5_W0_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_5_W0_LEN)-1)<<EF_DATA_EF_KEY_SLOT_5_W0_POS)
#define EF_DATA_EF_KEY_SLOT_5_W0_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_5_W0_LEN)-1)<<EF_DATA_EF_KEY_SLOT_5_W0_POS))

/* 0x94 : ef_key_slot_5_w1 */
#define EF_DATA_EF_KEY_SLOT_5_W1_OFFSET                         (0x94)
#define EF_DATA_EF_KEY_SLOT_5_W1                                EF_DATA_EF_KEY_SLOT_5_W1
#define EF_DATA_EF_KEY_SLOT_5_W1_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_5_W1_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_5_W1_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_5_W1_LEN)-1)<<EF_DATA_EF_KEY_SLOT_5_W1_POS)
#define EF_DATA_EF_KEY_SLOT_5_W1_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_5_W1_LEN)-1)<<EF_DATA_EF_KEY_SLOT_5_W1_POS))

/* 0x98 : ef_key_slot_5_w2 */
#define EF_DATA_EF_KEY_SLOT_5_W2_OFFSET                         (0x98)
#define EF_DATA_EF_KEY_SLOT_5_W2                                EF_DATA_EF_KEY_SLOT_5_W2
#define EF_DATA_EF_KEY_SLOT_5_W2_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_5_W2_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_5_W2_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_5_W2_LEN)-1)<<EF_DATA_EF_KEY_SLOT_5_W2_POS)
#define EF_DATA_EF_KEY_SLOT_5_W2_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_5_W2_LEN)-1)<<EF_DATA_EF_KEY_SLOT_5_W2_POS))

/* 0x9C : ef_key_slot_5_w3 */
#define EF_DATA_EF_KEY_SLOT_5_W3_OFFSET                         (0x9C)
#define EF_DATA_EF_KEY_SLOT_5_W3                                EF_DATA_EF_KEY_SLOT_5_W3
#define EF_DATA_EF_KEY_SLOT_5_W3_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_5_W3_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_5_W3_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_5_W3_LEN)-1)<<EF_DATA_EF_KEY_SLOT_5_W3_POS)
#define EF_DATA_EF_KEY_SLOT_5_W3_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_5_W3_LEN)-1)<<EF_DATA_EF_KEY_SLOT_5_W3_POS))

/* 0xA0 : ef_key_slot_6_w0 */
#define EF_DATA_EF_KEY_SLOT_6_W0_OFFSET                         (0xA0)
#define EF_DATA_EF_KEY_SLOT_6_W0                                EF_DATA_EF_KEY_SLOT_6_W0
#define EF_DATA_EF_KEY_SLOT_6_W0_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_6_W0_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_6_W0_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_6_W0_LEN)-1)<<EF_DATA_EF_KEY_SLOT_6_W0_POS)
#define EF_DATA_EF_KEY_SLOT_6_W0_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_6_W0_LEN)-1)<<EF_DATA_EF_KEY_SLOT_6_W0_POS))

/* 0xA4 : ef_key_slot_6_w1 */
#define EF_DATA_EF_KEY_SLOT_6_W1_OFFSET                         (0xA4)
#define EF_DATA_EF_KEY_SLOT_6_W1                                EF_DATA_EF_KEY_SLOT_6_W1
#define EF_DATA_EF_KEY_SLOT_6_W1_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_6_W1_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_6_W1_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_6_W1_LEN)-1)<<EF_DATA_EF_KEY_SLOT_6_W1_POS)
#define EF_DATA_EF_KEY_SLOT_6_W1_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_6_W1_LEN)-1)<<EF_DATA_EF_KEY_SLOT_6_W1_POS))

/* 0xA8 : ef_key_slot_6_w2 */
#define EF_DATA_EF_KEY_SLOT_6_W2_OFFSET                         (0xA8)
#define EF_DATA_EF_KEY_SLOT_6_W2                                EF_DATA_EF_KEY_SLOT_6_W2
#define EF_DATA_EF_KEY_SLOT_6_W2_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_6_W2_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_6_W2_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_6_W2_LEN)-1)<<EF_DATA_EF_KEY_SLOT_6_W2_POS)
#define EF_DATA_EF_KEY_SLOT_6_W2_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_6_W2_LEN)-1)<<EF_DATA_EF_KEY_SLOT_6_W2_POS))

/* 0xAC : ef_key_slot_6_w3 */
#define EF_DATA_EF_KEY_SLOT_6_W3_OFFSET                         (0xAC)
#define EF_DATA_EF_KEY_SLOT_6_W3                                EF_DATA_EF_KEY_SLOT_6_W3
#define EF_DATA_EF_KEY_SLOT_6_W3_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_6_W3_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_6_W3_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_6_W3_LEN)-1)<<EF_DATA_EF_KEY_SLOT_6_W3_POS)
#define EF_DATA_EF_KEY_SLOT_6_W3_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_6_W3_LEN)-1)<<EF_DATA_EF_KEY_SLOT_6_W3_POS))

/* 0xB0 : ef_key_slot_7_w0 */
#define EF_DATA_EF_KEY_SLOT_7_W0_OFFSET                         (0xB0)
#define EF_DATA_EF_KEY_SLOT_7_W0                                EF_DATA_EF_KEY_SLOT_7_W0
#define EF_DATA_EF_KEY_SLOT_7_W0_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_7_W0_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_7_W0_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_7_W0_LEN)-1)<<EF_DATA_EF_KEY_SLOT_7_W0_POS)
#define EF_DATA_EF_KEY_SLOT_7_W0_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_7_W0_LEN)-1)<<EF_DATA_EF_KEY_SLOT_7_W0_POS))

