zephyrproject-rtos/hal_bouffalolab/include/bouffalolab/bl808/ef_data_reg.h
/* 0xB4 : ef_key_slot_7_w1 */
#define EF_DATA_EF_KEY_SLOT_7_W1_OFFSET                         (0xB4)
#define EF_DATA_EF_KEY_SLOT_7_W1                                EF_DATA_EF_KEY_SLOT_7_W1
#define EF_DATA_EF_KEY_SLOT_7_W1_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_7_W1_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_7_W1_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_7_W1_LEN)-1)<<EF_DATA_EF_KEY_SLOT_7_W1_POS)
#define EF_DATA_EF_KEY_SLOT_7_W1_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_7_W1_LEN)-1)<<EF_DATA_EF_KEY_SLOT_7_W1_POS))

/* 0xB8 : ef_key_slot_7_w2 */
#define EF_DATA_EF_KEY_SLOT_7_W2_OFFSET                         (0xB8)
#define EF_DATA_EF_KEY_SLOT_7_W2                                EF_DATA_EF_KEY_SLOT_7_W2
#define EF_DATA_EF_KEY_SLOT_7_W2_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_7_W2_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_7_W2_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_7_W2_LEN)-1)<<EF_DATA_EF_KEY_SLOT_7_W2_POS)
#define EF_DATA_EF_KEY_SLOT_7_W2_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_7_W2_LEN)-1)<<EF_DATA_EF_KEY_SLOT_7_W2_POS))

/* 0xBC : ef_key_slot_7_w3 */
#define EF_DATA_EF_KEY_SLOT_7_W3_OFFSET                         (0xBC)
#define EF_DATA_EF_KEY_SLOT_7_W3                                EF_DATA_EF_KEY_SLOT_7_W3
#define EF_DATA_EF_KEY_SLOT_7_W3_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_7_W3_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_7_W3_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_7_W3_LEN)-1)<<EF_DATA_EF_KEY_SLOT_7_W3_POS)
#define EF_DATA_EF_KEY_SLOT_7_W3_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_7_W3_LEN)-1)<<EF_DATA_EF_KEY_SLOT_7_W3_POS))

/* 0xC0 : ef_key_slot_8_w0 */
#define EF_DATA_EF_KEY_SLOT_8_W0_OFFSET                         (0xC0)
#define EF_DATA_EF_KEY_SLOT_8_W0                                EF_DATA_EF_KEY_SLOT_8_W0
#define EF_DATA_EF_KEY_SLOT_8_W0_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_8_W0_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_8_W0_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_8_W0_LEN)-1)<<EF_DATA_EF_KEY_SLOT_8_W0_POS)
#define EF_DATA_EF_KEY_SLOT_8_W0_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_8_W0_LEN)-1)<<EF_DATA_EF_KEY_SLOT_8_W0_POS))

/* 0xC4 : ef_key_slot_8_w1 */
#define EF_DATA_EF_KEY_SLOT_8_W1_OFFSET                         (0xC4)
#define EF_DATA_EF_KEY_SLOT_8_W1                                EF_DATA_EF_KEY_SLOT_8_W1
#define EF_DATA_EF_KEY_SLOT_8_W1_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_8_W1_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_8_W1_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_8_W1_LEN)-1)<<EF_DATA_EF_KEY_SLOT_8_W1_POS)
#define EF_DATA_EF_KEY_SLOT_8_W1_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_8_W1_LEN)-1)<<EF_DATA_EF_KEY_SLOT_8_W1_POS))

/* 0xC8 : ef_key_slot_8_w2 */
#define EF_DATA_EF_KEY_SLOT_8_W2_OFFSET                         (0xC8)
#define EF_DATA_EF_KEY_SLOT_8_W2                                EF_DATA_EF_KEY_SLOT_8_W2
#define EF_DATA_EF_KEY_SLOT_8_W2_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_8_W2_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_8_W2_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_8_W2_LEN)-1)<<EF_DATA_EF_KEY_SLOT_8_W2_POS)
#define EF_DATA_EF_KEY_SLOT_8_W2_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_8_W2_LEN)-1)<<EF_DATA_EF_KEY_SLOT_8_W2_POS))

/* 0xCC : ef_key_slot_8_w3 */
#define EF_DATA_EF_KEY_SLOT_8_W3_OFFSET                         (0xCC)
#define EF_DATA_EF_KEY_SLOT_8_W3                                EF_DATA_EF_KEY_SLOT_8_W3
#define EF_DATA_EF_KEY_SLOT_8_W3_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_8_W3_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_8_W3_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_8_W3_LEN)-1)<<EF_DATA_EF_KEY_SLOT_8_W3_POS)
#define EF_DATA_EF_KEY_SLOT_8_W3_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_8_W3_LEN)-1)<<EF_DATA_EF_KEY_SLOT_8_W3_POS))

/* 0xD0 : ef_key_slot_9_w0 */
#define EF_DATA_EF_KEY_SLOT_9_W0_OFFSET                         (0xD0)
#define EF_DATA_EF_KEY_SLOT_9_W0                                EF_DATA_EF_KEY_SLOT_9_W0
#define EF_DATA_EF_KEY_SLOT_9_W0_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_9_W0_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_9_W0_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_9_W0_LEN)-1)<<EF_DATA_EF_KEY_SLOT_9_W0_POS)
#define EF_DATA_EF_KEY_SLOT_9_W0_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_9_W0_LEN)-1)<<EF_DATA_EF_KEY_SLOT_9_W0_POS))

/* 0xD4 : ef_key_slot_9_w1 */
#define EF_DATA_EF_KEY_SLOT_9_W1_OFFSET                         (0xD4)
#define EF_DATA_EF_KEY_SLOT_9_W1                                EF_DATA_EF_KEY_SLOT_9_W1
#define EF_DATA_EF_KEY_SLOT_9_W1_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_9_W1_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_9_W1_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_9_W1_LEN)-1)<<EF_DATA_EF_KEY_SLOT_9_W1_POS)
#define EF_DATA_EF_KEY_SLOT_9_W1_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_9_W1_LEN)-1)<<EF_DATA_EF_KEY_SLOT_9_W1_POS))

/* 0xD8 : ef_key_slot_9_w2 */
#define EF_DATA_EF_KEY_SLOT_9_W2_OFFSET                         (0xD8)
#define EF_DATA_EF_KEY_SLOT_9_W2                                EF_DATA_EF_KEY_SLOT_9_W2
#define EF_DATA_EF_KEY_SLOT_9_W2_POS                            (0U)
#define EF_DATA_EF_KEY_SLOT_9_W2_LEN                            (32U)
#define EF_DATA_EF_KEY_SLOT_9_W2_MSK                            (((1U<<EF_DATA_EF_KEY_SLOT_9_W2_LEN)-1)<<EF_DATA_EF_KEY_SLOT_9_W2_POS)
#define EF_DATA_EF_KEY_SLOT_9_W2_UMSK                           (~(((1U<<EF_DATA_EF_KEY_SLOT_9_W2_LEN)-1)<<EF_DATA_EF_KEY_SLOT_9_W2_POS))

