zephyrproject-rtos/hal_bouffalolab/include/bouffalolab/bl808/ef_data_reg.h
/* 0x100 : ef_zone_00_w0 */
#define EF_DATA_EF_ZONE_00_W0_OFFSET                            (0x100)

/* 0x104 : ef_zone_00_w1 */
#define EF_DATA_EF_ZONE_00_W1_OFFSET                            (0x104)

/* 0x108 : ef_zone_00_w2 */
#define EF_DATA_EF_ZONE_00_W2_OFFSET                            (0x108)

/* 0x10C : ef_zone_00_w3 */
#define EF_DATA_EF_ZONE_00_W3_OFFSET                            (0x10C)

/* 0x110 : ef_zone_01_w0 */
#define EF_DATA_EF_ZONE_01_W0_OFFSET                            (0x110)

/* 0x114 : ef_zone_01_w1 */
#define EF_DATA_EF_ZONE_01_W1_OFFSET                            (0x114)

/* 0x118 : ef_zone_01_w2 */
#define EF_DATA_EF_ZONE_01_W2_OFFSET                            (0x118)

/* 0x11C : ef_zone_01_w3 */
#define EF_DATA_EF_ZONE_01_W3_OFFSET                            (0x11C)

/* 0x120 : ef_zone_02_w0 */
#define EF_DATA_EF_ZONE_02_W0_OFFSET                            (0x120)

/* 0x124 : ef_zone_02_w1 */
#define EF_DATA_EF_ZONE_02_W1_OFFSET                            (0x124)

/* 0x128 : ef_zone_02_w2 */
#define EF_DATA_EF_ZONE_02_W2_OFFSET                            (0x128)

/* 0x12C : ef_zone_02_w3 */
#define EF_DATA_EF_ZONE_02_W3_OFFSET                            (0x12C)

/* 0x130 : ef_zone_03_w0 */
#define EF_DATA_EF_ZONE_03_W0_OFFSET                            (0x130)

/* 0x134 : ef_zone_03_w1 */
#define EF_DATA_EF_ZONE_03_W1_OFFSET                            (0x134)

/* 0x138 : ef_zone_03_w2 */
#define EF_DATA_EF_ZONE_03_W2_OFFSET                            (0x138)

/* 0x13C : ef_zone_03_w3 */
#define EF_DATA_EF_ZONE_03_W3_OFFSET                            (0x13C)

/* 0x140 : ef_zone_04_w0 */
#define EF_DATA_EF_ZONE_04_W0_OFFSET                            (0x140)

/* 0x144 : ef_zone_04_w1 */
#define EF_DATA_EF_ZONE_04_W1_OFFSET                            (0x144)

/* 0x148 : ef_zone_04_w2 */
#define EF_DATA_EF_ZONE_04_W2_OFFSET                            (0x148)

/* 0x14C : ef_zone_04_w3 */
#define EF_DATA_EF_ZONE_04_W3_OFFSET                            (0x14C)

/* 0x150 : ef_zone_05_w0 */
#define EF_DATA_EF_ZONE_05_W0_OFFSET                            (0x150)

/* 0x154 : ef_zone_05_w1 */
#define EF_DATA_EF_ZONE_05_W1_OFFSET                            (0x154)

/* 0x158 : ef_zone_05_w2 */
#define EF_DATA_EF_ZONE_05_W2_OFFSET                            (0x158)

/* 0x15C : ef_zone_05_w3 */
#define EF_DATA_EF_ZONE_05_W3_OFFSET                            (0x15C)

/* 0x160 : ef_zone_06_w0 */
#define EF_DATA_EF_ZONE_06_W0_OFFSET                            (0x160)

/* 0x164 : ef_zone_06_w1 */
#define EF_DATA_EF_ZONE_06_W1_OFFSET                            (0x164)

/* 0x168 : ef_zone_06_w2 */
#define EF_DATA_EF_ZONE_06_W2_OFFSET                            (0x168)

/* 0x16C : ef_zone_06_w3 */
#define EF_DATA_EF_ZONE_06_W3_OFFSET                            (0x16C)

/* 0x170 : ef_zone_07_w0 */
#define EF_DATA_EF_ZONE_07_W0_OFFSET                            (0x170)

/* 0x174 : ef_zone_07_w1 */
#define EF_DATA_EF_ZONE_07_W1_OFFSET                            (0x174)

/* 0x178 : ef_zone_07_w2 */
#define EF_DATA_EF_ZONE_07_W2_OFFSET                            (0x178)

/* 0x17C : ef_zone_07_w3 */
#define EF_DATA_EF_ZONE_07_W3_OFFSET                            (0x17C)

/* 0x180 : ef_zone_08_w0 */
#define EF_DATA_EF_ZONE_08_W0_OFFSET                            (0x180)

/* 0x184 : ef_zone_08_w1 */
#define EF_DATA_EF_ZONE_08_W1_OFFSET                            (0x184)

/* 0x188 : ef_zone_08_w2 */
#define EF_DATA_EF_ZONE_08_W2_OFFSET                            (0x188)

/* 0x18C : ef_zone_08_w3 */
#define EF_DATA_EF_ZONE_08_W3_OFFSET                            (0x18C)

/* 0x190 : ef_zone_09_w0 */
#define EF_DATA_EF_ZONE_09_W0_OFFSET                            (0x190)

/* 0x194 : ef_zone_09_w1 */
#define EF_DATA_EF_ZONE_09_W1_OFFSET                            (0x194)

/* 0x198 : ef_zone_09_w2 */
#define EF_DATA_EF_ZONE_09_W2_OFFSET                            (0x198)

/* 0x19C : ef_zone_09_w3 */
#define EF_DATA_EF_ZONE_09_W3_OFFSET                            (0x19C)

/* 0x1A0 : ef_zone_10_w0 */
#define EF_DATA_EF_ZONE_10_W0_OFFSET                            (0x1A0)

/* 0x1A4 : ef_zone_10_w1 */
#define EF_DATA_EF_ZONE_10_W1_OFFSET                            (0x1A4)

/* 0x1A8 : ef_zone_10_w2 */
#define EF_DATA_EF_ZONE_10_W2_OFFSET                            (0x1A8)

/* 0x1AC : ef_zone_10_w3 */
#define EF_DATA_EF_ZONE_10_W3_OFFSET                            (0x1AC)

/* 0x1B0 : ef_zone_11_w0 */
#define EF_DATA_EF_ZONE_11_W0_OFFSET                            (0x1B0)

/* 0x1B4 : ef_zone_11_w1 */
#define EF_DATA_EF_ZONE_11_W1_OFFSET                            (0x1B4)

/* 0x1B8 : ef_zone_11_w2 */
#define EF_DATA_EF_ZONE_11_W2_OFFSET                            (0x1B8)

/* 0x1BC : ef_zone_11_w3 */
#define EF_DATA_EF_ZONE_11_W3_OFFSET                            (0x1BC)

/* 0x1C0 : ef_zone_12_w0 */
#define EF_DATA_EF_ZONE_12_W0_OFFSET                            (0x1C0)

/* 0x1C4 : ef_zone_12_w1 */
#define EF_DATA_EF_ZONE_12_W1_OFFSET                            (0x1C4)

/* 0x1C8 : ef_zone_12_w2 */
#define EF_DATA_EF_ZONE_12_W2_OFFSET                            (0x1C8)

/* 0x1CC : ef_zone_12_w3 */
#define EF_DATA_EF_ZONE_12_W3_OFFSET                            (0x1CC)

/* 0x1D0 : ef_zone_13_w0 */
#define EF_DATA_EF_ZONE_13_W0_OFFSET                            (0x1D0)

/* 0x1D4 : ef_zone_13_w1 */
#define EF_DATA_EF_ZONE_13_W1_OFFSET                            (0x1D4)

/* 0x1D8 : ef_zone_13_w2 */
#define EF_DATA_EF_ZONE_13_W2_OFFSET                            (0x1D8)

/* 0x1DC : ef_zone_13_w3 */
#define EF_DATA_EF_ZONE_13_W3_OFFSET                            (0x1DC)

/* 0x1E0 : ef_zone_14_w0 */
#define EF_DATA_EF_ZONE_14_W0_OFFSET                            (0x1E0)

/* 0x1E4 : ef_zone_14_w1 */
#define EF_DATA_EF_ZONE_14_W1_OFFSET                            (0x1E4)

/* 0x1E8 : ef_zone_14_w2 */
#define EF_DATA_EF_ZONE_14_W2_OFFSET                            (0x1E8)

/* 0x1EC : ef_zone_14_w3 */
#define EF_DATA_EF_ZONE_14_W3_OFFSET                            (0x1EC)

/* 0x1F0 : ef_zone_15_w0 */
#define EF_DATA_EF_ZONE_15_W0_OFFSET                            (0x1F0)

/* 0x1F4 : ef_zone_15_w1 */
#define EF_DATA_EF_ZONE_15_W1_OFFSET                            (0x1F4)

/* 0x1F8 : ef_zone_15_w2 */
#define EF_DATA_EF_ZONE_15_W2_OFFSET                            (0x1F8)

/* 0x1FC : ef_zone_15_w3 */
#define EF_DATA_EF_ZONE_15_W3_OFFSET                            (0x1FC)
#define EF_DATA_EF_ZONE_15_W3                                   EF_DATA_EF_ZONE_15_W3
#define EF_DATA_EF_ZONE_15_W3_POS                               (0U)
#define EF_DATA_EF_ZONE_15_W3_LEN                               (16U)
#define EF_DATA_EF_ZONE_15_W3_MSK                               (((1U<<EF_DATA_EF_ZONE_15_W3_LEN)-1)<<EF_DATA_EF_ZONE_15_W3_POS)
#define EF_DATA_EF_ZONE_15_W3_UMSK                              (~(((1U<<EF_DATA_EF_ZONE_15_W3_LEN)-1)<<EF_DATA_EF_ZONE_15_W3_POS))
#define EF_DATA_WR_LOCK_EF_ZONE_00                              EF_DATA_WR_LOCK_EF_ZONE_00
#define EF_DATA_WR_LOCK_EF_ZONE_00_POS                          (16U)
#define EF_DATA_WR_LOCK_EF_ZONE_00_LEN                          (1U)
#define EF_DATA_WR_LOCK_EF_ZONE_00_MSK                          (((1U<<EF_DATA_WR_LOCK_EF_ZONE_00_LEN)-1)<<EF_DATA_WR_LOCK_EF_ZONE_00_POS)
#define EF_DATA_WR_LOCK_EF_ZONE_00_UMSK                         (~(((1U<<EF_DATA_WR_LOCK_EF_ZONE_00_LEN)-1)<<EF_DATA_WR_LOCK_EF_ZONE_00_POS))
#define EF_DATA_WR_LOCK_EF_ZONE_01                              EF_DATA_WR_LOCK_EF_ZONE_01
#define EF_DATA_WR_LOCK_EF_ZONE_01_POS                          (17U)
#define EF_DATA_WR_LOCK_EF_ZONE_01_LEN                          (1U)
#define EF_DATA_WR_LOCK_EF_ZONE_01_MSK                          (((1U<<EF_DATA_WR_LOCK_EF_ZONE_01_LEN)-1)<<EF_DATA_WR_LOCK_EF_ZONE_01_POS)
#define EF_DATA_WR_LOCK_EF_ZONE_01_UMSK                         (~(((1U<<EF_DATA_WR_LOCK_EF_ZONE_01_LEN)-1)<<EF_DATA_WR_LOCK_EF_ZONE_01_POS))
#define EF_DATA_WR_LOCK_EF_ZONE_02                              EF_DATA_WR_LOCK_EF_ZONE_02
#define EF_DATA_WR_LOCK_EF_ZONE_02_POS                          (18U)
#define EF_DATA_WR_LOCK_EF_ZONE_02_LEN                          (1U)
#define EF_DATA_WR_LOCK_EF_ZONE_02_MSK                          (((1U<<EF_DATA_WR_LOCK_EF_ZONE_02_LEN)-1)<<EF_DATA_WR_LOCK_EF_ZONE_02_POS)
#define EF_DATA_WR_LOCK_EF_ZONE_02_UMSK                         (~(((1U<<EF_DATA_WR_LOCK_EF_ZONE_02_LEN)-1)<<EF_DATA_WR_LOCK_EF_ZONE_02_POS))
#define EF_DATA_WR_LOCK_EF_ZONE_03                              EF_DATA_WR_LOCK_EF_ZONE_03
#define EF_DATA_WR_LOCK_EF_ZONE_03_POS                          (19U)
#define EF_DATA_WR_LOCK_EF_ZONE_03_LEN                          (1U)
#define EF_DATA_WR_LOCK_EF_ZONE_03_MSK                          (((1U<<EF_DATA_WR_LOCK_EF_ZONE_03_LEN)-1)<<EF_DATA_WR_LOCK_EF_ZONE_03_POS)
#define EF_DATA_WR_LOCK_EF_ZONE_03_UMSK                         (~(((1U<<EF_DATA_WR_LOCK_EF_ZONE_03_LEN)-1)<<EF_DATA_WR_LOCK_EF_ZONE_03_POS))
#define EF_DATA_WR_LOCK_EF_ZONE_04                              EF_DATA_WR_LOCK_EF_ZONE_04
#define EF_DATA_WR_LOCK_EF_ZONE_04_POS                          (20U)
#define EF_DATA_WR_LOCK_EF_ZONE_04_LEN                          (1U)
#define EF_DATA_WR_LOCK_EF_ZONE_04_MSK                          (((1U<<EF_DATA_WR_LOCK_EF_ZONE_04_LEN)-1)<<EF_DATA_WR_LOCK_EF_ZONE_04_POS)
#define EF_DATA_WR_LOCK_EF_ZONE_04_UMSK                         (~(((1U<<EF_DATA_WR_LOCK_EF_ZONE_04_LEN)-1)<<EF_DATA_WR_LOCK_EF_ZONE_04_POS))
#define EF_DATA_WR_LOCK_EF_ZONE_05                              EF_DATA_WR_LOCK_EF_ZONE_05
#define EF_DATA_WR_LOCK_EF_ZONE_05_POS                          (21U)
#define EF_DATA_WR_LOCK_EF_ZONE_05_LEN                          (1U)
#define EF_DATA_WR_LOCK_EF_ZONE_05_MSK                          (((1U<<EF_DATA_WR_LOCK_EF_ZONE_05_LEN)-1)<<EF_DATA_WR_LOCK_EF_ZONE_05_POS)
#define EF_DATA_WR_LOCK_EF_ZONE_05_UMSK                         (~(((1U<<EF_DATA_WR_LOCK_EF_ZONE_05_LEN)-1)<<EF_DATA_WR_LOCK_EF_ZONE_05_POS))
#define EF_DATA_WR_LOCK_EF_ZONE_06                              EF_DATA_WR_LOCK_EF_ZONE_06
#define EF_DATA_WR_LOCK_EF_ZONE_06_POS                          (22U)
#define EF_DATA_WR_LOCK_EF_ZONE_06_LEN                          (1U)
#define EF_DATA_WR_LOCK_EF_ZONE_06_MSK                          (((1U<<EF_DATA_WR_LOCK_EF_ZONE_06_LEN)-1)<<EF_DATA_WR_LOCK_EF_ZONE_06_POS)
#define EF_DATA_WR_LOCK_EF_ZONE_06_UMSK                         (~(((1U<<EF_DATA_WR_LOCK_EF_ZONE_06_LEN)-1)<<EF_DATA_WR_LOCK_EF_ZONE_06_POS))
#define EF_DATA_WR_LOCK_EF_ZONE_07                              EF_DATA_WR_LOCK_EF_ZONE_07
#define EF_DATA_WR_LOCK_EF_ZONE_07_POS                          (23U)
#define EF_DATA_WR_LOCK_EF_ZONE_07_LEN                          (1U)
#define EF_DATA_WR_LOCK_EF_ZONE_07_MSK                          (((1U<<EF_DATA_WR_LOCK_EF_ZONE_07_LEN)-1)<<EF_DATA_WR_LOCK_EF_ZONE_07_POS)
#define EF_DATA_WR_LOCK_EF_ZONE_07_UMSK                         (~(((1U<<EF_DATA_WR_LOCK_EF_ZONE_07_LEN)-1)<<EF_DATA_WR_LOCK_EF_ZONE_07_POS))
#define EF_DATA_WR_LOCK_EF_ZONE_08                              EF_DATA_WR_LOCK_EF_ZONE_08
#define EF_DATA_WR_LOCK_EF_ZONE_08_POS                          (24U)
#define EF_DATA_WR_LOCK_EF_ZONE_08_LEN                          (1U)
#define EF_DATA_WR_LOCK_EF_ZONE_08_MSK                          (((1U<<EF_DATA_WR_LOCK_EF_ZONE_08_LEN)-1)<<EF_DATA_WR_LOCK_EF_ZONE_08_POS)
#define EF_DATA_WR_LOCK_EF_ZONE_08_UMSK                         (~(((1U<<EF_DATA_WR_LOCK_EF_ZONE_08_LEN)-1)<<EF_DATA_WR_LOCK_EF_ZONE_08_POS))
#define EF_DATA_WR_LOCK_EF_ZONE_09                              EF_DATA_WR_LOCK_EF_ZONE_09
#define EF_DATA_WR_LOCK_EF_ZONE_09_POS                          (25U)
#define EF_DATA_WR_LOCK_EF_ZONE_09_LEN                          (1U)
#define EF_DATA_WR_LOCK_EF_ZONE_09_MSK                          (((1U<<EF_DATA_WR_LOCK_EF_ZONE_09_LEN)-1)<<EF_DATA_WR_LOCK_EF_ZONE_09_POS)
#define EF_DATA_WR_LOCK_EF_ZONE_09_UMSK                         (~(((1U<<EF_DATA_WR_LOCK_EF_ZONE_09_LEN)-1)<<EF_DATA_WR_LOCK_EF_ZONE_09_POS))
#define EF_DATA_WR_LOCK_EF_ZONE_10                              EF_DATA_WR_LOCK_EF_ZONE_10
#define EF_DATA_WR_LOCK_EF_ZONE_10_POS                          (26U)
#define EF_DATA_WR_LOCK_EF_ZONE_10_LEN                          (1U)
#define EF_DATA_WR_LOCK_EF_ZONE_10_MSK                          (((1U<<EF_DATA_WR_LOCK_EF_ZONE_10_LEN)-1)<<EF_DATA_WR_LOCK_EF_ZONE_10_POS)
#define EF_DATA_WR_LOCK_EF_ZONE_10_UMSK                         (~(((1U<<EF_DATA_WR_LOCK_EF_ZONE_10_LEN)-1)<<EF_DATA_WR_LOCK_EF_ZONE_10_POS))
#define EF_DATA_WR_LOCK_EF_ZONE_11                              EF_DATA_WR_LOCK_EF_ZONE_11
#define EF_DATA_WR_LOCK_EF_ZONE_11_POS                          (27U)
#define EF_DATA_WR_LOCK_EF_ZONE_11_LEN                          (1U)
#define EF_DATA_WR_LOCK_EF_ZONE_11_MSK                          (((1U<<EF_DATA_WR_LOCK_EF_ZONE_11_LEN)-1)<<EF_DATA_WR_LOCK_EF_ZONE_11_POS)
#define EF_DATA_WR_LOCK_EF_ZONE_11_UMSK                         (~(((1U<<EF_DATA_WR_LOCK_EF_ZONE_11_LEN)-1)<<EF_DATA_WR_LOCK_EF_ZONE_11_POS))
#define EF_DATA_WR_LOCK_EF_ZONE_12                              EF_DATA_WR_LOCK_EF_ZONE_12
#define EF_DATA_WR_LOCK_EF_ZONE_12_POS                          (28U)
#define EF_DATA_WR_LOCK_EF_ZONE_12_LEN                          (1U)
#define EF_DATA_WR_LOCK_EF_ZONE_12_MSK                          (((1U<<EF_DATA_WR_LOCK_EF_ZONE_12_LEN)-1)<<EF_DATA_WR_LOCK_EF_ZONE_12_POS)
#define EF_DATA_WR_LOCK_EF_ZONE_12_UMSK                         (~(((1U<<EF_DATA_WR_LOCK_EF_ZONE_12_LEN)-1)<<EF_DATA_WR_LOCK_EF_ZONE_12_POS))
#define EF_DATA_WR_LOCK_EF_ZONE_13                              EF_DATA_WR_LOCK_EF_ZONE_13
#define EF_DATA_WR_LOCK_EF_ZONE_13_POS                          (29U)
#define EF_DATA_WR_LOCK_EF_ZONE_13_LEN                          (1U)
#define EF_DATA_WR_LOCK_EF_ZONE_13_MSK                          (((1U<<EF_DATA_WR_LOCK_EF_ZONE_13_LEN)-1)<<EF_DATA_WR_LOCK_EF_ZONE_13_POS)
#define EF_DATA_WR_LOCK_EF_ZONE_13_UMSK                         (~(((1U<<EF_DATA_WR_LOCK_EF_ZONE_13_LEN)-1)<<EF_DATA_WR_LOCK_EF_ZONE_13_POS))
#define EF_DATA_WR_LOCK_EF_ZONE_14                              EF_DATA_WR_LOCK_EF_ZONE_14
#define EF_DATA_WR_LOCK_EF_ZONE_14_POS                          (30U)
#define EF_DATA_WR_LOCK_EF_ZONE_14_LEN                          (1U)
#define EF_DATA_WR_LOCK_EF_ZONE_14_MSK                          (((1U<<EF_DATA_WR_LOCK_EF_ZONE_14_LEN)-1)<<EF_DATA_WR_LOCK_EF_ZONE_14_POS)
#define EF_DATA_WR_LOCK_EF_ZONE_14_UMSK                         (~(((1U<<EF_DATA_WR_LOCK_EF_ZONE_14_LEN)-1)<<EF_DATA_WR_LOCK_EF_ZONE_14_POS))
#define EF_DATA_WR_LOCK_EF_ZONE_15                              EF_DATA_WR_LOCK_EF_ZONE_15
#define EF_DATA_WR_LOCK_EF_ZONE_15_POS                          (31U)
#define EF_DATA_WR_LOCK_EF_ZONE_15_LEN                          (1U)
#define EF_DATA_WR_LOCK_EF_ZONE_15_MSK                          (((1U<<EF_DATA_WR_LOCK_EF_ZONE_15_LEN)-1)<<EF_DATA_WR_LOCK_EF_ZONE_15_POS)
#define EF_DATA_WR_LOCK_EF_ZONE_15_UMSK                         (~(((1U<<EF_DATA_WR_LOCK_EF_ZONE_15_LEN)-1)<<EF_DATA_WR_LOCK_EF_ZONE_15_POS))


