zephyrproject-rtos/hal_bouffalolab/include/bouffalolab/bl808/ef_data_reg.h
struct  ef_data_reg {
    /* 0x0 : ef_cfg_0 */
    union {
        struct {
            uint32_t ef_sf_aes_mode                 :  2; /* [ 1: 0],        r/w,        0x0 */
            uint32_t ef_ai_dis                      :  1; /* [    2],        r/w,        0x0 */
            uint32_t ef_cpu0_dis                    :  1; /* [    3],        r/w,        0x0 */
            uint32_t ef_sboot_en                    :  2; /* [ 5: 4],        r/w,        0x0 */
            uint32_t ef_uart_dis                    :  4; /* [ 9: 6],        r/w,        0x0 */
            uint32_t ef_bus_rmp_sw_en               :  1; /* [   10],        r/w,        0x0 */
            uint32_t ef_bus_rmp_dis                 :  1; /* [   11],        r/w,        0x0 */
            uint32_t ef_sf_key_re_sel               :  2; /* [13:12],        r/w,        0x0 */
            uint32_t ef_sdu_dis                     :  1; /* [   14],        r/w,        0x0 */
            uint32_t ef_btdm_dis                    :  1; /* [   15],        r/w,        0x0 */
            uint32_t ef_wifi_dis                    :  1; /* [   16],        r/w,        0x0 */
            uint32_t ef_0_key_enc_en                :  1; /* [   17],        r/w,        0x0 */
            uint32_t ef_cam_dis                     :  1; /* [   18],        r/w,        0x0 */
            uint32_t ef_m154_dis                    :  1; /* [   19],        r/w,        0x0 */
            uint32_t ef_sdu_rst_opt                 :  1; /* [   20],        r/w,        0x0 */
            uint32_t ef_cpu_rst_dbg_dis             :  1; /* [   21],        r/w,        0x0 */
            uint32_t ef_se_dbg_dis                  :  1; /* [   22],        r/w,        0x0 */
            uint32_t ef_efuse_dbg_dis               :  1; /* [   23],        r/w,        0x0 */
            uint32_t ef_dbg_jtag_1_dis              :  2; /* [25:24],        r/w,        0x0 */
            uint32_t ef_dbg_jtag_0_dis              :  2; /* [27:26],        r/w,        0x0 */
            uint32_t ef_dbg_mode                    :  4; /* [31:28],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_cfg_0;

    /* 0x4 : ef_dbg_pwd_low */
    union {
        struct {
            uint32_t ef_dbg_pwd_low                 : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_dbg_pwd_low;

    /* 0x8 : ef_dbg_pwd_high */
    union {
        struct {
            uint32_t ef_dbg_pwd_high                : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_dbg_pwd_high;

    /* 0xC : ef_dbg_pwd2_low */
    union {
        struct {
            uint32_t ef_dbg_pwd2_low                : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_dbg_pwd2_low;

    /* 0x10 : ef_dbg_pwd2_high */
    union {
        struct {
            uint32_t ef_dbg_pwd2_high               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_dbg_pwd2_high;

    /* 0x14 : ef_wifi_mac_low */
    union {
        struct {
            uint32_t ef_wifi_mac_low                : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_wifi_mac_low;

    /* 0x18 : ef_wifi_mac_high */
    union {
        struct {
            uint32_t ef_wifi_mac_high               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_wifi_mac_high;

    /* 0x1C : ef_key_slot_0_w0 */
    union {
        struct {
            uint32_t ef_key_slot_0_w0               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_0_w0;

    /* 0x20 : ef_key_slot_0_w1 */
    union {
        struct {
            uint32_t ef_key_slot_0_w1               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_0_w1;

    /* 0x24 : ef_key_slot_0_w2 */
    union {
        struct {
            uint32_t ef_key_slot_0_w2               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_0_w2;

    /* 0x28 : ef_key_slot_0_w3 */
    union {
        struct {
            uint32_t ef_key_slot_0_w3               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_0_w3;

    /* 0x2C : ef_key_slot_1_w0 */
    union {
        struct {
            uint32_t ef_key_slot_1_w0               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_1_w0;

    /* 0x30 : ef_key_slot_1_w1 */
    union {
        struct {
            uint32_t ef_key_slot_1_w1               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_1_w1;

    /* 0x34 : ef_key_slot_1_w2 */
    union {
        struct {
            uint32_t ef_key_slot_1_w2               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_1_w2;

    /* 0x38 : ef_key_slot_1_w3 */
    union {
        struct {
            uint32_t ef_key_slot_1_w3               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_1_w3;

    /* 0x3C : ef_key_slot_2_w0 */
    union {
        struct {
            uint32_t ef_key_slot_2_w0               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_2_w0;

    /* 0x40 : ef_key_slot_2_w1 */
    union {
        struct {
            uint32_t ef_key_slot_2_w1               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_2_w1;

    /* 0x44 : ef_key_slot_2_w2 */
    union {
        struct {
            uint32_t ef_key_slot_2_w2               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_2_w2;

    /* 0x48 : ef_key_slot_2_w3 */
    union {
        struct {
            uint32_t ef_key_slot_2_w3               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_2_w3;

    /* 0x4C : ef_key_slot_3_w0 */
    union {
        struct {
            uint32_t ef_key_slot_3_w0               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_3_w0;

    /* 0x50 : ef_key_slot_3_w1 */
    union {
        struct {
            uint32_t ef_key_slot_3_w1               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_3_w1;

