zephyrproject-rtos/hal_bouffalolab/include/bouffalolab/bl808/ef_data_reg.h
    /* 0x54 : ef_key_slot_3_w2 */
    union {
        struct {
            uint32_t ef_key_slot_3_w2               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_3_w2;

    /* 0x58 : ef_key_slot_3_w3 */
    union {
        struct {
            uint32_t ef_key_slot_3_w3               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_3_w3;

    /* 0x5C : ef_sw_usage_0 */
    union {
        struct {
            uint32_t ef_sw_usage_0                  : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_sw_usage_0;

    /* 0x60 : ef_sw_usage_1 */
    union {
        struct {
            uint32_t ef_sw_usage_1                  : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_sw_usage_1;

    /* 0x64 : ef_sw_usage_2 */
    union {
        struct {
            uint32_t ef_sw_usage_2                  : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_sw_usage_2;

    /* 0x68 : ef_sw_usage_3 */
    union {
        struct {
            uint32_t ef_sw_usage_3                  : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_sw_usage_3;

    /* 0x6C : ef_key_slot_11_w0 */
    union {
        struct {
            uint32_t ef_key_slot_11_w0              : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_11_w0;

    /* 0x70 : ef_key_slot_11_w1 */
    union {
        struct {
            uint32_t ef_key_slot_11_w1              : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_11_w1;

    /* 0x74 : ef_key_slot_11_w2 */
    union {
        struct {
            uint32_t ef_key_slot_11_w2              : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_11_w2;

    /* 0x78 : ef_key_slot_11_w3 */
    union {
        struct {
            uint32_t ef_key_slot_11_w3              : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_11_w3;

    /* 0x7C : ef_data_0_lock */
    union {
        struct {
            uint32_t ef_sec_lifecycle               :  4; /* [ 3: 0],        r/w,        0x0 */
            uint32_t wr_lock_rsvd_0                 :  9; /* [12: 4],        r/w,        0x0 */
            uint32_t flash_dly_coe                  :  1; /* [   13],        r/w,        0x0 */
            uint32_t wr_lock_boot_mode              :  1; /* [   14],        r/w,        0x0 */
            uint32_t wr_lock_dbg_pwd                :  1; /* [   15],        r/w,        0x0 */
            uint32_t wr_lock_wifi_mac               :  1; /* [   16],        r/w,        0x0 */
            uint32_t wr_lock_key_slot_0             :  1; /* [   17],        r/w,        0x0 */
            uint32_t wr_lock_key_slot_1             :  1; /* [   18],        r/w,        0x0 */
            uint32_t wr_lock_key_slot_2             :  1; /* [   19],        r/w,        0x0 */
            uint32_t wr_lock_key_slot_3             :  1; /* [   20],        r/w,        0x0 */
            uint32_t wr_lock_sw_usage_0             :  1; /* [   21],        r/w,        0x0 */
            uint32_t wr_lock_sw_usage_1             :  1; /* [   22],        r/w,        0x0 */
            uint32_t wr_lock_sw_usage_2             :  1; /* [   23],        r/w,        0x0 */
            uint32_t wr_lock_sw_usage_3             :  1; /* [   24],        r/w,        0x0 */
            uint32_t wr_lock_key_slot_11            :  1; /* [   25],        r/w,        0x0 */
            uint32_t rd_lock_dbg_pwd                :  1; /* [   26],        r/w,        0x0 */
            uint32_t rd_lock_key_slot_0             :  1; /* [   27],        r/w,        0x0 */
            uint32_t rd_lock_key_slot_1             :  1; /* [   28],        r/w,        0x0 */
            uint32_t rd_lock_key_slot_2             :  1; /* [   29],        r/w,        0x0 */
            uint32_t rd_lock_key_slot_3             :  1; /* [   30],        r/w,        0x0 */
            uint32_t rd_lock_key_slot_11            :  1; /* [   31],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_data_0_lock;

    /* 0x80 : ef_key_slot_4_w0 */
    union {
        struct {
            uint32_t ef_key_slot_4_w0               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_4_w0;

    /* 0x84 : ef_key_slot_4_w1 */
    union {
        struct {
            uint32_t ef_key_slot_4_w1               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_4_w1;

    /* 0x88 : ef_key_slot_4_w2 */
    union {
        struct {
            uint32_t ef_key_slot_4_w2               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_4_w2;

    /* 0x8C : ef_key_slot_4_w3 */
    union {
        struct {
            uint32_t ef_key_slot_4_w3               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_4_w3;

    /* 0x90 : ef_key_slot_5_w0 */
    union {
        struct {
            uint32_t ef_key_slot_5_w0               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_5_w0;

    /* 0x94 : ef_key_slot_5_w1 */
    union {
        struct {
            uint32_t ef_key_slot_5_w1               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_5_w1;

    /* 0x98 : ef_key_slot_5_w2 */
    union {
        struct {
            uint32_t ef_key_slot_5_w2               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_5_w2;

    /* 0x9C : ef_key_slot_5_w3 */
    union {
        struct {
            uint32_t ef_key_slot_5_w3               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_5_w3;

    /* 0xA0 : ef_key_slot_6_w0 */
    union {
        struct {
            uint32_t ef_key_slot_6_w0               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_6_w0;

