zephyrproject-rtos/hal_bouffalolab/include/bouffalolab/bl808/ef_data_reg.h
    /* 0xA4 : ef_key_slot_6_w1 */
    union {
        struct {
            uint32_t ef_key_slot_6_w1               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_6_w1;

    /* 0xA8 : ef_key_slot_6_w2 */
    union {
        struct {
            uint32_t ef_key_slot_6_w2               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_6_w2;

    /* 0xAC : ef_key_slot_6_w3 */
    union {
        struct {
            uint32_t ef_key_slot_6_w3               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_6_w3;

    /* 0xB0 : ef_key_slot_7_w0 */
    union {
        struct {
            uint32_t ef_key_slot_7_w0               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_7_w0;

    /* 0xB4 : ef_key_slot_7_w1 */
    union {
        struct {
            uint32_t ef_key_slot_7_w1               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_7_w1;

    /* 0xB8 : ef_key_slot_7_w2 */
    union {
        struct {
            uint32_t ef_key_slot_7_w2               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_7_w2;

    /* 0xBC : ef_key_slot_7_w3 */
    union {
        struct {
            uint32_t ef_key_slot_7_w3               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_7_w3;

    /* 0xC0 : ef_key_slot_8_w0 */
    union {
        struct {
            uint32_t ef_key_slot_8_w0               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_8_w0;

    /* 0xC4 : ef_key_slot_8_w1 */
    union {
        struct {
            uint32_t ef_key_slot_8_w1               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_8_w1;

    /* 0xC8 : ef_key_slot_8_w2 */
    union {
        struct {
            uint32_t ef_key_slot_8_w2               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_8_w2;

    /* 0xCC : ef_key_slot_8_w3 */
    union {
        struct {
            uint32_t ef_key_slot_8_w3               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_8_w3;

    /* 0xD0 : ef_key_slot_9_w0 */
    union {
        struct {
            uint32_t ef_key_slot_9_w0               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_9_w0;

    /* 0xD4 : ef_key_slot_9_w1 */
    union {
        struct {
            uint32_t ef_key_slot_9_w1               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_9_w1;

    /* 0xD8 : ef_key_slot_9_w2 */
    union {
        struct {
            uint32_t ef_key_slot_9_w2               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_9_w2;

    /* 0xDC : ef_key_slot_9_w3 */
    union {
        struct {
            uint32_t ef_key_slot_9_w3               : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_9_w3;

    /* 0xE0 : ef_key_slot_10_w0 */
    union {
        struct {
            uint32_t ef_key_slot_10_w0              : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_10_w0;

    /* 0xE4 : ef_key_slot_10_w1 */
    union {
        struct {
            uint32_t ef_key_slot_10_w1              : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_10_w1;

    /* 0xE8 : ef_key_slot_10_w2 */
    union {
        struct {
            uint32_t ef_key_slot_10_w2              : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_10_w2;

    /* 0xEC : ef_key_slot_10_w3 */
    union {
        struct {
            uint32_t ef_key_slot_10_w3              : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_key_slot_10_w3;

    /* 0xF0 : ef_dat_1_rsvd_0 */
    union {
        struct {
            uint32_t ef_dat_1_rsvd_0                : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_dat_1_rsvd_0;

    /* 0xF4 : ef_dat_1_rsvd_1 */
    union {
        struct {
            uint32_t ef_dat_1_rsvd_1                : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_dat_1_rsvd_1;

    /* 0xF8 : ef_dat_1_rsvd_2 */
    union {
        struct {
            uint32_t ef_dat_1_rsvd_2                : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_dat_1_rsvd_2;

    /* 0xFC : ef_data_1_lock */
    union {
        struct {
            uint32_t wr_lock_rsvd_1                 : 15; /* [14: 0],        r/w,        0x0 */
            uint32_t wr_lock_key_slot_4             :  1; /* [   15],        r/w,        0x0 */
            uint32_t wr_lock_key_slot_5             :  1; /* [   16],        r/w,        0x0 */
            uint32_t wr_lock_key_slot_6             :  1; /* [   17],        r/w,        0x0 */
            uint32_t wr_lock_key_slot_7             :  1; /* [   18],        r/w,        0x0 */
            uint32_t wr_lock_key_slot_8             :  1; /* [   19],        r/w,        0x0 */
            uint32_t wr_lock_key_slot_9             :  1; /* [   20],        r/w,        0x0 */
            uint32_t wr_lock_key_slot_10            :  1; /* [   21],        r/w,        0x0 */
            uint32_t wr_lock_dat_1_rsvd_0           :  1; /* [   22],        r/w,        0x0 */
            uint32_t wr_lock_dat_1_rsvd_1           :  1; /* [   23],        r/w,        0x0 */
            uint32_t wr_lock_dat_1_rsvd_2           :  1; /* [   24],        r/w,        0x0 */
            uint32_t rd_lock_key_slot_4             :  1; /* [   25],        r/w,        0x0 */
            uint32_t rd_lock_key_slot_5             :  1; /* [   26],        r/w,        0x0 */
            uint32_t rd_lock_key_slot_6             :  1; /* [   27],        r/w,        0x0 */
            uint32_t rd_lock_key_slot_7             :  1; /* [   28],        r/w,        0x0 */
            uint32_t rd_lock_key_slot_8             :  1; /* [   29],        r/w,        0x0 */
            uint32_t rd_lock_key_slot_9             :  1; /* [   30],        r/w,        0x0 */
            uint32_t rd_lock_key_slot_10            :  1; /* [   31],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_data_1_lock;

