zephyrproject-rtos/hal_bouffalolab/include/bouffalolab/bl808/ef_data_reg.h
    /* 0x100 : ef_zone_00_w0 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_00_w0;

    /* 0x104 : ef_zone_00_w1 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_00_w1;

    /* 0x108 : ef_zone_00_w2 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_00_w2;

    /* 0x10C : ef_zone_00_w3 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_00_w3;

    /* 0x110 : ef_zone_01_w0 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_01_w0;

    /* 0x114 : ef_zone_01_w1 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_01_w1;

    /* 0x118 : ef_zone_01_w2 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_01_w2;

    /* 0x11C : ef_zone_01_w3 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_01_w3;

    /* 0x120 : ef_zone_02_w0 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_02_w0;

    /* 0x124 : ef_zone_02_w1 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_02_w1;

    /* 0x128 : ef_zone_02_w2 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_02_w2;

    /* 0x12C : ef_zone_02_w3 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_02_w3;

    /* 0x130 : ef_zone_03_w0 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_03_w0;

    /* 0x134 : ef_zone_03_w1 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_03_w1;

    /* 0x138 : ef_zone_03_w2 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_03_w2;

    /* 0x13C : ef_zone_03_w3 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_03_w3;

    /* 0x140 : ef_zone_04_w0 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_04_w0;

    /* 0x144 : ef_zone_04_w1 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_04_w1;

    /* 0x148 : ef_zone_04_w2 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_04_w2;

    /* 0x14C : ef_zone_04_w3 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_04_w3;

    /* 0x150 : ef_zone_05_w0 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_05_w0;

    /* 0x154 : ef_zone_05_w1 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_05_w1;

    /* 0x158 : ef_zone_05_w2 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_05_w2;

    /* 0x15C : ef_zone_05_w3 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_05_w3;

    /* 0x160 : ef_zone_06_w0 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_06_w0;

    /* 0x164 : ef_zone_06_w1 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_06_w1;

    /* 0x168 : ef_zone_06_w2 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_06_w2;

    /* 0x16C : ef_zone_06_w3 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_06_w3;

    /* 0x170 : ef_zone_07_w0 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_07_w0;

    /* 0x174 : ef_zone_07_w1 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_07_w1;

    /* 0x178 : ef_zone_07_w2 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_07_w2;

    /* 0x17C : ef_zone_07_w3 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_07_w3;

    /* 0x180 : ef_zone_08_w0 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_08_w0;

    /* 0x184 : ef_zone_08_w1 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_08_w1;

