zephyrproject-rtos/hal_bouffalolab/include/bouffalolab/bl808/ef_data_reg.h
    /* 0x188 : ef_zone_08_w2 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_08_w2;

    /* 0x18C : ef_zone_08_w3 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_08_w3;

    /* 0x190 : ef_zone_09_w0 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_09_w0;

    /* 0x194 : ef_zone_09_w1 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_09_w1;

    /* 0x198 : ef_zone_09_w2 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_09_w2;

    /* 0x19C : ef_zone_09_w3 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_09_w3;

    /* 0x1A0 : ef_zone_10_w0 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_10_w0;

    /* 0x1A4 : ef_zone_10_w1 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_10_w1;

    /* 0x1A8 : ef_zone_10_w2 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_10_w2;

    /* 0x1AC : ef_zone_10_w3 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_10_w3;

    /* 0x1B0 : ef_zone_11_w0 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_11_w0;

    /* 0x1B4 : ef_zone_11_w1 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_11_w1;

    /* 0x1B8 : ef_zone_11_w2 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_11_w2;

    /* 0x1BC : ef_zone_11_w3 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_11_w3;

    /* 0x1C0 : ef_zone_12_w0 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_12_w0;

    /* 0x1C4 : ef_zone_12_w1 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_12_w1;

    /* 0x1C8 : ef_zone_12_w2 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_12_w2;

    /* 0x1CC : ef_zone_12_w3 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_12_w3;

    /* 0x1D0 : ef_zone_13_w0 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_13_w0;

    /* 0x1D4 : ef_zone_13_w1 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_13_w1;

    /* 0x1D8 : ef_zone_13_w2 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_13_w2;

    /* 0x1DC : ef_zone_13_w3 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_13_w3;

    /* 0x1E0 : ef_zone_14_w0 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_14_w0;

    /* 0x1E4 : ef_zone_14_w1 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_14_w1;

    /* 0x1E8 : ef_zone_14_w2 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_14_w2;

    /* 0x1EC : ef_zone_14_w3 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_14_w3;

    /* 0x1F0 : ef_zone_15_w0 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_15_w0;

    /* 0x1F4 : ef_zone_15_w1 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_15_w1;

    /* 0x1F8 : ef_zone_15_w2 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_15_w2;

    /* 0x1FC : ef_zone_15_w3 */
    union {
        struct {
            uint32_t ef_zone_15_w3                  : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t wr_lock_ef_zone_00             :  1; /* [   16],        r/w,        0x0 */
            uint32_t wr_lock_ef_zone_01             :  1; /* [   17],        r/w,        0x0 */
            uint32_t wr_lock_ef_zone_02             :  1; /* [   18],        r/w,        0x0 */
            uint32_t wr_lock_ef_zone_03             :  1; /* [   19],        r/w,        0x0 */
            uint32_t wr_lock_ef_zone_04             :  1; /* [   20],        r/w,        0x0 */
            uint32_t wr_lock_ef_zone_05             :  1; /* [   21],        r/w,        0x0 */
            uint32_t wr_lock_ef_zone_06             :  1; /* [   22],        r/w,        0x0 */
            uint32_t wr_lock_ef_zone_07             :  1; /* [   23],        r/w,        0x0 */
            uint32_t wr_lock_ef_zone_08             :  1; /* [   24],        r/w,        0x0 */
            uint32_t wr_lock_ef_zone_09             :  1; /* [   25],        r/w,        0x0 */
            uint32_t wr_lock_ef_zone_10             :  1; /* [   26],        r/w,        0x0 */
            uint32_t wr_lock_ef_zone_11             :  1; /* [   27],        r/w,        0x0 */
            uint32_t wr_lock_ef_zone_12             :  1; /* [   28],        r/w,        0x0 */
            uint32_t wr_lock_ef_zone_13             :  1; /* [   29],        r/w,        0x0 */
            uint32_t wr_lock_ef_zone_14             :  1; /* [   30],        r/w,        0x0 */
            uint32_t wr_lock_ef_zone_15             :  1; /* [   31],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ef_zone_15_w3;

};

typedef volatile struct ef_data_reg ef_data_reg_t;


#endif  /* __EF_DATA_REG_H__ */
